# Lab | Customer Analysis Round 1

### First Step, importing and opening files

In [1]:
import numpy as np
import pandas as pd

In [2]:
!ls

Case Study "Healthcare for all".ipynb IronYamila
Customer Analysis Round 1             Untitled.ipynb
Healthcare                            data_class_labs
IronGloria

In [3]:
cd Customer Analysis Round 1

/Users/ymrteran/Documents/GitHub/Ironhack Labs/Customer Analysis Round 1

In [4]:
file1 = pd.read_excel('file1.xlsx')

In [5]:
file2 = pd.read_excel('file2.xlsx')

In [6]:
file3 = pd.read_excel('file3.xlsx')

### Checking the files info to rearrange and rename columns as needed

In [7]:
file1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1071 entries, 0 to 1070
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   1071 non-null   object
 1   ST                         1071 non-null   object
 2   GENDER                     954 non-null    object
 3   Education                  1071 non-null   object
 4   Customer Lifetime Value    1068 non-null   object
 5   Income                     1071 non-null   int64
 6   Monthly Premium Auto       1071 non-null   int64
 7   Number of Open Complaints  1071 non-null   object
 8   Policy Type                1071 non-null   object
 9   Vehicle Class              1071 non-null   object
 10  Total Claim Amount         1071 non-null   float64
dtypes: float64(1), int64(2), object(8)
memory usage: 92.2+ KB

In [8]:
file1 = file1.rename(columns={"ST": "State", "GENDER": "Gender"})

In [9]:
file1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1071 entries, 0 to 1070
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   1071 non-null   object
 1   State                      1071 non-null   object
 2   Gender                     954 non-null    object
 3   Education                  1071 non-null   object
 4   Customer Lifetime Value    1068 non-null   object
 5   Income                     1071 non-null   int64
 6   Monthly Premium Auto       1071 non-null   int64
 7   Number of Open Complaints  1071 non-null   object
 8   Policy Type                1071 non-null   object
 9   Vehicle Class              1071 non-null   object
 10  Total Claim Amount         1071 non-null   float64
dtypes: float64(1), int64(2), object(8)
memory usage: 92.2+ KB

In [10]:
file2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 996 entries, 0 to 995
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   996 non-null    object
 1   ST                         996 non-null    object
 2   GENDER                     991 non-null    object
 3   Education                  996 non-null    object
 4   Customer Lifetime Value    992 non-null    object
 5   Income                     996 non-null    int64
 6   Monthly Premium Auto       996 non-null    int64
 7   Number of Open Complaints  996 non-null    object
 8   Total Claim Amount         996 non-null    float64
 9   Policy Type                996 non-null    object
 10  Vehicle Class              996 non-null    object
dtypes: float64(1), int64(2), object(8)
memory usage: 85.7+ KB

In [11]:
file2 = file2.rename(columns={"ST": "State", "GENDER": "Gender"})

In [12]:
file2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 996 entries, 0 to 995
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   996 non-null    object
 1   State                      996 non-null    object
 2   Gender                     991 non-null    object
 3   Education                  996 non-null    object
 4   Customer Lifetime Value    992 non-null    object
 5   Income                     996 non-null    int64
 6   Monthly Premium Auto       996 non-null    int64
 7   Number of Open Complaints  996 non-null    object
 8   Total Claim Amount         996 non-null    float64
 9   Policy Type                996 non-null    object
 10  Vehicle Class              996 non-null    object
dtypes: float64(1), int64(2), object(8)
memory usage: 85.7+ KB

In [13]:
file2 = file2.reindex(columns = ["Customer","State","Gender","Education","Customer Lifetime Value","Income","Monthly Premium Auto","Number of Open Complaints","Policy Type","Vehicle Class","Total Claim Amount"])

In [14]:
file2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 996 entries, 0 to 995
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   996 non-null    object
 1   State                      996 non-null    object
 2   Gender                     991 non-null    object
 3   Education                  996 non-null    object
 4   Customer Lifetime Value    992 non-null    object
 5   Income                     996 non-null    int64
 6   Monthly Premium Auto       996 non-null    int64
 7   Number of Open Complaints  996 non-null    object
 8   Policy Type                996 non-null    object
 9   Vehicle Class              996 non-null    object
 10  Total Claim Amount         996 non-null    float64
dtypes: float64(1), int64(2), object(8)
memory usage: 85.7+ KB

In [15]:
file3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7070 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   7070 non-null   object
 1   State                      7070 non-null   object
 2   Customer Lifetime Value    7070 non-null   float64
 3   Education                  7070 non-null   object
 4   Gender                     7070 non-null   object
 5   Income                     7070 non-null   int64
 6   Monthly Premium Auto       7070 non-null   int64
 7   Number of Open Complaints  7070 non-null   int64
 8   Policy Type                7070 non-null   object
 9   Total Claim Amount         7070 non-null   float64
 10  Vehicle Class              7070 non-null   object
dtypes: float64(2), int64(3), object(6)
memory usage: 607.7+ KB

In [16]:
file3 = file3.reindex(columns = ["Customer","State","Gender","Education","Customer Lifetime Value","Income","Monthly Premium Auto","Number of Open Complaints","Policy Type","Vehicle Class","Total Claim Amount"])

In [17]:
file3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7070 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   7070 non-null   object
 1   State                      7070 non-null   object
 2   Gender                     7070 non-null   object
 3   Education                  7070 non-null   object
 4   Customer Lifetime Value    7070 non-null   float64
 5   Income                     7070 non-null   int64
 6   Monthly Premium Auto       7070 non-null   int64
 7   Number of Open Complaints  7070 non-null   int64
 8   Policy Type                7070 non-null   object
 9   Vehicle Class              7070 non-null   object
 10  Total Claim Amount         7070 non-null   float64
dtypes: float64(2), int64(3), object(6)
memory usage: 607.7+ KB

### Creating the dataframe, concatenating and reindexing

In [18]:
columns=file1.columns

In [19]:
data=pd.DataFrame(columns=columns)

In [20]:
data

Empty DataFrame
Columns: [Customer, State, Gender, Education, Customer Lifetime Value, Income, Monthly Premium Auto, Number of Open Complaints, Policy Type, Vehicle Class, Total Claim Amount]
Index: []

In [21]:
data=pd.concat([data,file1,file2,file3],axis=0)

In [22]:
data

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0,1000,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0,94,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767,108,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0,106,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357,68,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,Bachelor,23405.98798,71941,73,0,Personal Auto,Four-Door Car,198.234764
7066,PK87824,California,F,College,3096.511217,21604,79,0,Corporate Auto,Four-Door Car,379.200000
7067,TD14365,California,M,Bachelor,8163.890428,0,85,3,Corporate Auto,Four-Door Car,790.784983
7068,UP19263,California,M,College,7524.442436,21941,96,0,Personal Auto,Four-Door Car,691.200000
7069,Y167826,California,M,College,2611.836866,0,77,0,Corporate Auto,Two-Door Car,369.600000

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9137 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   9137 non-null   object
 1   State                      9137 non-null   object
 2   Gender                     9015 non-null   object
 3   Education                  9137 non-null   object
 4   Customer Lifetime Value    9130 non-null   object
 5   Income                     9137 non-null   object
 6   Monthly Premium Auto       9137 non-null   object
 7   Number of Open Complaints  9137 non-null   object
 8   Policy Type                9137 non-null   object
 9   Vehicle Class              9137 non-null   object
 10  Total Claim Amount         9137 non-null   float64
dtypes: float64(1), object(10)
memory usage: 856.6+ KB

In [24]:
data.reset_index(drop=True, inplace=True)

### Data types

In [25]:
data.dtypes

Customer                      object
State                         object
Gender                        object
Education                     object
Customer Lifetime Value       object
Income                        object
Monthly Premium Auto          object
Number of Open Complaints     object
Policy Type                   object
Vehicle Class                 object
Total Claim Amount           float64
dtype: object

### Cleaning data

Delete column education and the number of open complaints

In [26]:
cleandata = data.drop(['Education','Number of Open Complaints'],axis=1)

Correct the values in the column customer lifetime value, multiply them by 100 and change dtype to numerical type.

In [27]:
cleandata['Customer Lifetime Value'] = cleandata['Customer Lifetime Value'].str.rstrip('%').astype('float') * 100

In [28]:
cleandata

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,69795359.0,0,94,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,128874317.0,48767,108,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,76458618.0,0,106,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,53630765.0,36357,68,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...
9132,LA72316,California,M,NaN,71941,73,Personal Auto,Four-Door Car,198.234764
9133,PK87824,California,F,NaN,21604,79,Corporate Auto,Four-Door Car,379.200000
9134,TD14365,California,M,NaN,0,85,Corporate Auto,Four-Door Car,790.784983
9135,UP19263,California,M,NaN,21941,96,Personal Auto,Four-Door Car,691.200000
9136,Y167826,California,M,NaN,0,77,Corporate Auto,Two-Door Car,369.600000

In [29]:
cleandata.dtypes

Customer                    object
State                       object
Gender                      object
Customer Lifetime Value    float64
Income                      object
Monthly Premium Auto        object
Policy Type                 object
Vehicle Class               object
Total Claim Amount         float64
dtype: object

Check for duplicate rows in the data and remove if any

In [30]:
cleandata=cleandata.drop_duplicates()

In [31]:
cleandata.shape

(9130, 9)

Filter out the data for customers who have an income of 0 or less

In [32]:
filterdata=cleandata.query('Income<=0')

In [33]:
filterdata

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,69795359.0,0,94,Personal Auto,Four-Door Car,1131.464935
3,WW63253,California,M,76458618.0,0,106,Corporate Auto,SUV,529.881344
7,CF85061,Arizona,M,72161003.0,0,101,Corporate Auto,Four-Door Car,363.029680
10,SX51350,California,M,47389920.0,0,67,Personal Auto,Four-Door Car,482.400000
...,...,...,...,...,...,...,...,...,...
9126,WZ45103,California,F,NaN,0,76,Personal Auto,Four-Door Car,364.800000
9128,RX91025,California,M,NaN,0,185,Personal Auto,SUV,1950.725547
9129,AC13887,California,M,NaN,0,67,Corporate Auto,Two-Door Car,482.400000
9134,TD14365,California,M,NaN,0,85,Corporate Auto,Four-Door Car,790.784983
9136,Y167826,California,M,NaN,0,77,Corporate Auto,Two-Door Car,369.600000